# pandas 기초2 : 데이터프레임 조회 및 집계

## 3.데이터프레임 조회

- 보고자 하는 데이터를 즉시 조회할 수 있도록 반복 학습과 실습을 통해 익숙해져야 합니다.
- 데이터프레임을 대상으로 조회하는 방법은 다양합니다.
- 그 중 한 가지 방법을 선택해 일관되게 사용하기를 권고합니다.

In [1]:
# 라이브러리 불러오기
import pandas as pd

### (1) 데이터 읽어오기

* Attrition 데이터 불러오기

**[Attrition 데이터 셋 정보]**

|	구분	|	변수 명	|	내용	|	type	|	비고	|
|----|----|----|----|----|
|	**Target**	|	**Attrition**	|	이직여부, Yes , No	|	범주	| 1- 이직, 0- 잔류		|
|	feature	|	Age	|	나이	|	숫자	|		|
|	feature	|	DistanceFromHome	|	집-직장 거리	|	숫자	|	마일	|
|	feature	|	EmployNumber	|	사번	|	숫자	| 	|
|	feature	|	Gender	|	성별	|	범주	| Male, Female		|
|	feature	|	JobSatisfaction	|	직무 만족도	|	범주	|	1 Low, 2 Medium, 3 High, 4 Very High	|
|	feature	|	MaritalStatus	|	결혼상태	|	범주	| Single, Married, Divorced		|
|	feature	|	MonthlyIncome	|	월급	|	숫자	| 달러	|
|	feature	|	OverTime	|	야근여부	|	범주	|	Yes, No	|
|	feature	|	PercentSalaryHike	|	전년대비 급여인상율	|	숫자	|	%	|
|	feature	|	TotalWorkingYears	|	총 경력 연수	|	숫자	|		|

In [2]:
# 데이터 읽어오기
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/Attrition_simple2.CSV'
data = pd.read_csv(path)  

# 상위 5개 확인
data.head(5)

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

In [7]:
# 확인
print(data['Age']) # Series
print(data[['Age']]) # Dataframe

0       33
1       35
2       42
3       46
4       22
        ..
1191    32
1192    27
1193    29
1194    29
1195    43
Name: Age, Length: 1196, dtype: int64
<class 'pandas.core.frame.DataFrame'>

* 시리즈(Series)와 데이터프레임(DataFrame)
    * 데이터프레임 : 2차원 구조
    * 시리즈 : 1차원 구조
        * 데이터프레임에서 열 하나를 띄어 내면 시리즈!

<img src='https://github.com/DA4BAM/image/blob/main/%EC%8B%9C%EB%A6%AC%EC%A6%88,%20%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84.png?raw=true' width=500 align="left"/>

### (2) 특정 열 조회

- **df.loc[ : , [열 이름1, 열 이름2,...]]** 형태로 조회할 열 이름을 리스트로 지정합니다.
- 열 부분은 생략할 수 있었지만, **행 부분을 생략할 수는 없습니다.**
- 하지만 **df[[열 이름1, 열 이름2,...]]** 형태로 인덱서를 생략함이 일반적입니다.
- 조회할 열이 하나면 리스트 형태가 아니어도 됩니다.

In [ ]:
# Attrition 열 조회 : 시리즈로 조회
data['Attrition']

In [ ]:
# Attrition 열 조회2 : 시리즈로 조회
data.Attrition

In [ ]:
# Attrition, Age 열 조회 : 데이터프레임으로 조회
# 대괄호 안에 또 대괄호로 읽지 마시고, 대괄호 안에 리스트!!!
data[['Attrition', 'Age' ]]

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] data 데이터프레임에 대해 아래 요구사항에 맞는 구문을 작성하고 실행하세요.

In [66]:
# 상위 5개 행 조회
import numpy as np
import pandas as pd

at_data = pd.read_csv('attrition.csv')
at_data.head()

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

In [67]:
# PercentSalaryHike 열만 조회
at_data['PercentSalaryHike']

0       11
1       11
2       13
3       23
4       16
        ..
1191    12
1192    11
1193    18
1194    14
1195    22
Name: PercentSalaryHike, Length: 1196, dtype: int64

In [68]:
#  Age, DistanceFromHome, Gender열만 조회
at_data[['Age','DistanceFromHome', 'Gender']]

      Age  DistanceFromHome  Gender
0      33                 7    Male
1      35                18    Male
2      42                 6    Male
3      46                 2  Female
4      22                 4    Male
...   ...               ...     ...
1191   32                 5  Female
1192   27                19    Male
1193   29                 9    Male
1194   29                 2    Male
1195   43                16  Female

[1196 rows x 3 columns]

In [69]:
# Age, DistanceFromHome, Gender열만 DistanceFromHome 열 기준으로 내림차순 정렬해서 조회
at_data[['Age','DistanceFromHome','Gender']].sort_values(by='DistanceFromHome', ascending=False)

      Age  DistanceFromHome  Gender
198    50                29    Male
245    32                29  Female
614    24                29    Male
810    48                29  Female
312    57                29    Male
...   ...               ...     ...
138    34                 1  Female
410    32                 1  Female
1050   28                 1  Female
778    33                 1    Male
124    35                 1  Female

[1196 rows x 3 columns]

### (3) 조건으로 조회 : **.loc**

- **df.loc[조건]** 형태로 조건을 지정해 조건에 만족하는 데이터만 조회할 수 있습니다.
- 우선 조건이 제대로 판단이 되는지 확인한 후 그 **조건을 대 괄호 안에** 넣으면 됩니다.

#### 1) 단일 조건 조회

In [14]:
# 조건절(조건문)의 결과는 True, False
data['DistanceFromHome'] > 10

0       False
1        True
2       False
3       False
4       False
        ...
1191    False
1192     True
1193    False
1194    False
1195     True
Name: DistanceFromHome, Length: 1196, dtype: bool

In [70]:
# DistanceFromHome 열 값이 10 보다 큰 행 조회
data.loc[data['DistanceFromHome'] > 10]

KeyError: 'DistanceFromHome'

In [20]:
display(data.head())
data.loc[:,['Age','Gender']]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

      Age  Gender
0      33    Male
1      35    Male
2      42    Male
3      46  Female
4      22    Male
...   ...     ...
1191   32  Female
1192   27    Male
1193   29    Male
1194   29    Male
1195   43  Female

[1196 rows x 2 columns]

#### 2) 여러 조건 조회

- [ ]안에 조건을 여러개 연결할 때 **and와 or 대신에 &와 |**를 사용해야 합니다.
- 그리고 각 조건들은 **(조건1) & (조건2)** 형태로 **괄호**로 묶어야 합니다.

In [ ]:
# and로 여러 조건 연결
data.loc[(data['DistanceFromHome'] > 10) & (data['JobSatisfaction'] == 4)]

In [ ]:
# or 조건 : |
data.loc[(data['DistanceFromHome'] > 10) | (data['JobSatisfaction'] == 4)]

#### 3) isin(), between()

- **isin([값1, 값2,..., 값n])**: 값1 또는 값2 또는...값n인 데이터만 조회합니다.
- 주의 isin(**리스트**) 값들을 리스트 형태로 입력해야 합니다.

In [ ]:
# 값 나열
data.loc[data['JobSatisfaction'].isin([1,4])]

- 위 구문은 다음과 같은 의미를 갖습니다.

In [21]:
# or 조건
data.loc[(data['JobSatisfaction'] == 1) | (data['JobSatisfaction'] == 4)]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
5,0,24,21,1551,Male,1,Divorced,2296,No,14,2
7,0,30,20,1084,Male,1,Married,9957,No,15,7
...,...,...,...,...,...,...,...,...,...,...,...
1184,0,33,5,1395,Male,4,Married,9998,No,13,8
1185,0,24,10,1746,Male,4,Married,2145,No,14,3
1190,0,27,5,844,Male,4,Divorced,12808,Yes,16,9
1192,0,27,19,1619,Male,1,Divorced,4066,No,11,7
1195,0,43,16,327,Female,4,Married,16064,Yes,22,22

- **between(값1, 값2)**: 값1 ~ 값2까지 범위안의 데이터만 조회합니다.

    * inclusive = 'both' (기본값)
        * 'left', 'right', 'neither'

In [23]:
# 범위 지정
data.loc[data['Age'].between(25, 30)]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
7,0,30,20,1084,Male,1,Married,9957,No,15,7
8,0,26,6,686,Female,4,Married,2659,Yes,13,3
16,0,30,5,197,Female,1,Divorced,3204,No,14,8
28,0,26,1,1893,Female,3,Married,2933,Yes,13,1
32,0,30,7,1224,Male,3,Divorced,3491,No,13,10
...,...,...,...,...,...,...,...,...,...,...,...
1188,0,29,19,1497,Male,3,Divorced,8620,No,14,10
1190,0,27,5,844,Male,4,Divorced,12808,Yes,16,9
1192,0,27,19,1619,Male,1,Divorced,4066,No,11,7
1193,0,29,9,1558,Male,3,Married,2451,No,18,5
1194,0,29,2,469,Male,3,Married,4649,No,14,4

- 위 구문은 다음과 같은 의미를 갖습니다.

In [22]:
# and 조건
data.loc[(data['Age'] >= 25) & (data['Age'] <= 30)]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
7,0,30,20,1084,Male,1,Married,9957,No,15,7
8,0,26,6,686,Female,4,Married,2659,Yes,13,3
16,0,30,5,197,Female,1,Divorced,3204,No,14,8
28,0,26,1,1893,Female,3,Married,2933,Yes,13,1
32,0,30,7,1224,Male,3,Divorced,3491,No,13,10
...,...,...,...,...,...,...,...,...,...,...,...
1188,0,29,19,1497,Male,3,Divorced,8620,No,14,10
1190,0,27,5,844,Male,4,Divorced,12808,Yes,16,9
1192,0,27,19,1619,Male,1,Divorced,4066,No,11,7
1193,0,29,9,1558,Male,3,Married,2451,No,18,5
1194,0,29,2,469,Male,3,Married,4649,No,14,4

#### **4) 조건을 만족하는 행의 일부 열 조회**

- **df.loc[조건, ['열 이름1', '열 이름2',...]]** 형태로 조회할 열을 리스트로 지정합니다. ==> 2차원, 데이터프레임형태로 조회

In [ ]:
# 조건에 맞는 하나의 열 조회
data.loc[data['MonthlyIncome'] >= 10000, ['Age']]

In [ ]:
# 조건에 맞는 여러 열 조회
data.loc[data['MonthlyIncome'] >= 10000, ['Age', 'MaritalStatus', 'TotalWorkingYears']]

### (4) 복습문제

[문1] pandas 라이브러리를 pd 별칭을 주어 불러오세요.

In [ ]:
# 라이브러리 불러오기

[문2] read_csv() 함수를 사용해 다음 경로의 파일을 불러와 **titanic** 데이터프레임을 만드세요.

- 파일 경로: 'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'

**[titanic_simple 데이터 셋 정보]**

- PassengerId : 승객번호
- Survived : 생존여부(1:생존, 0:사망)
- Pclass : 객실등급(1:1등급, 2:2등급, 3:3등급)
- Name : 승객이름
- Sex : 성별(male, female)
- Age : 나이
- Fare : 운임($)
- Embarked : 승선지역(Southhampton, Cherbourg, Queenstown)

In [25]:
# 파일 읽어오기
name_data = pd.read_csv('https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv')
name_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton

[문3] Name 열만 조회하세요.

In [78]:
titanic = pd.read_csv('titanic.csv')
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare',
       'Embarked'],
      dtype='object')

[문4] Name, Age, Sex 열만 조회하세요.

In [79]:
titanic[['Name','Age','Sex']].head()

                                                Name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina  26.0  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                           Allen, Mr. William Henry  35.0    male

[문5] Name, Age, Sex 열의 상위 10개 행만 확인하세요.

[문6] 나이가 70세 이상인 탑승객을 조회하시오.

In [80]:
titanic[titanic['Age']>=70]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,34.6542,Cherbourg
116,117,0,3,"Connors, Mr. Patrick",male,70.5,7.7500,Queenstown
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,49.5042,Cherbourg
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,30.0000,Southampton
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,10.5000,Southampton
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,71.0000,Southampton
851,852,0,3,"Svensson, Mr. Johan",male,74.0,7.7750,Southampton

[문7] Fare(운임)의 평균을 Fare_mean으로 저장하고 그 값을 확인하세요.

In [82]:
Fare_mean = titanic['Fare'].mean()
Fare_mean

32.204207968574636

[문8] 평균 운임보다 적게 내고 탑승한 승객을 조회하시오.

In [83]:
titanic[titanic['Fare'] < Fare_mean]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583,Queenstown
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,Southampton
...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,Southampton
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,Southampton
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500,Southampton
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,Cherbourg
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,Queenstown

[문9] 승선지역(Embarked)이 'Southhampton', 'Queenstown' 인 승객을 조회하시오.

In [86]:
titanic[titanic['Embarked'].isin(['Southapton','Queenstown'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583,Queenstown
16,17,0,3,"Rice, Master. Eugene",male,2.0,29.1250,Queenstown
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,8.0292,Queenstown
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,7.8792,Queenstown
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,7.7500,Queenstown
...,...,...,...,...,...,...,...,...
790,791,0,3,"Keane, Mr. Andrew ""Andy""",male,NaN,7.7500,Queenstown
825,826,0,3,"Flynn, Mr. John",male,NaN,6.9500,Queenstown
828,829,1,3,"McCormack, Mr. Thomas Joseph",male,NaN,7.7500,Queenstown
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,Queenstown
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,Queenstown

[문10] 나이(Age)가 10대(10이상, 20 미만)인 남자 청소년의 평균 운임(Fare)을 구해 봅시다.

In [87]:
titanic[titanic['Age'].between(10,20)]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,Cherbourg
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,8.0500,Southampton
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,7.8542,Southampton
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,8.0292,Queenstown
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,263.0000,Southampton
...,...,...,...,...,...,...,...,...
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,9.3500,Southampton
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,7.2250,Cherbourg
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,9.8458,Southampton
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,7.8958,Southampton
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,Southampton

## 4.데이터프레임 집계

- 상세 데이터가 아닌 집계된 데이터에 대한 분석을 자주 요구하니 익숙해져야 할 내용입니다.
- sum(), mean(), max(), min(), count() 메소드를 사용해 지정한 열 또는 열들을 기준으로 집계합니다.
- 평균을 구하는 메소드가 avg()가 아닌 mean() 임을 주의하기 바랍니다.

In [ ]:
# 라이브러리 불러오기
import pandas as pd

* Attrition 데이터 불러오기

**[Attrition 데이터 셋 정보]**

|	구분	|	변수 명	|	내용	|	type	|	비고	|
|----|----|----|----|----|
|	**Target**	|	**Attrition**	|	이직여부, Yes , No	|	범주	| 1- 이직, 0- 잔류		|
|	feature	|	Age	|	나이	|	숫자	|		|
|	feature	|	DistanceFromHome	|	집-직장 거리	|	숫자	|	마일	|
|	feature	|	EmployNumber	|	사번	|	숫자	| 	|
|	feature	|	Gender	|	성별	|	범주	| Male, Female		|
|	feature	|	JobSatisfaction	|	직무 만족도	|	범주	|	1 Low, 2 Medium, 3 High, 4 Very High	|
|	feature	|	MaritalStatus	|	결혼상태	|	범주	| Single, Married, Divorced		|
|	feature	|	MonthlyIncome	|	월급	|	숫자	| 달러	|
|	feature	|	OverTime	|	야근여부	|	범주	|	Yes, No	|
|	feature	|	PercentSalaryHike	|	전년대비 급여인상율	|	숫자	|	%	|
|	feature	|	TotalWorkingYears	|	총 경력 연수	|	숫자	|		|

In [99]:
# 데이터 읽어오기
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/Attrition_simple2.CSV'
data = pd.read_csv(path)  

# 상위 5개 확인
data.head(5)

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

### (1) 열 하나 집계

- 우선 특정 열의 값 합은 다음과 같이 구할 수 있습니다.

In [100]:
# MonthlyIncome 합계
data['MonthlyIncome'].sum()

7798045

In [101]:
# MonthlyIncome, TotalWorkingYears 각각의 평균
data[['MonthlyIncome', 'TotalWorkingYears']].mean()

MonthlyIncome        6520.104515
TotalWorkingYears      11.330268
dtype: float64

#### 1) 집계하기

- 만일 day 별로 합을 구하고자 한다면 다음과 같이 합니다.
- 아래 결과 값 네 개를 더하면 전체 합이 됩니다.
- **as_index=True**를 설정(기본값)하면 집계 기준이 되는 열이 인덱스 열이 됩니다.
- 집계 결과가 data 열만 가지니 **시리즈**가 됩니다.

In [102]:
# MaritalStatus 별 Age 평균 --> 시리즈
data.groupby('MaritalStatus', as_index=True)['Age'].mean()

MaritalStatus
Divorced    37.522727
Married     37.704380
Single      35.460938
Name: Age, dtype: float64

- [['data']].sum()과 같이 하면 열이 여럿이라는 의미여서 결과가 **데이터프레임**이 됩니다.

In [103]:
# MaritalStatus 별 Age 평균 --> 데이터프레임
data.groupby('MaritalStatus', as_index=True)[['Age']].mean()

                     Age
MaritalStatus
Divorced       37.522727
Married        37.704380
Single         35.460938

- **as_index=False**를 설정하면 행 번호를 기반으로 한 정수 값이 인덱스로 설정됩니다.

In [104]:
# MaritalStatus 별 Age 평균 --> 데이터프레임
data.groupby('MaritalStatus', as_index=False)[['Age']].mean()

  MaritalStatus        Age
0      Divorced  37.522727
1       Married  37.704380
2        Single  35.460938

#### 2) 데이터프레임으로 선언

- 집계 결과를 새로운 데이터프레임으로 선언하여 사용하는 경우가 많습니다.
- 집계된 결과를 반복해서 사용하거나, 분석 대상이 되는 경우 데이터프레임으로 선언함이 유익합니다.

In [105]:
data.groupby('MaritalStatus', as_index=False)[['Age']].mean()

  MaritalStatus        Age
0      Divorced  37.522727
1       Married  37.704380
2        Single  35.460938

### (2) 여러 열 집계

- 여러 열에 대한 집계를 같이 할 수 있습니다.
- **[ ['feature1', 'feature2'] ].sum()** 형태와 같이 집계 대상 열을 리스트로 지정합니다.

In [106]:
data.groupby('MaritalStatus', as_index=False)[['Age','MonthlyIncome']].mean()

  MaritalStatus        Age  MonthlyIncome
0      Divorced  37.522727    6707.018939
1       Married  37.704380    6880.144161
2        Single  35.460938    5877.794271

- sum() 메소드 앞에 아무 열도 지정하지 않으면 **기준열 이외의 모든 열에 대한 집계**가 수행됩니다.
    * 향후에는 이 기능이 제거될 수 있으므로 숫자형 변수만 집계되도록 명시적으로 지정할 필요가 있음

In [107]:
data.groupby('MaritalStatus', as_index=False).sum()

,MaritalStatus,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,Divorced,23,9906,2404,266305,MaleFemaleFemaleMaleFemaleMaleMaleFemaleFemale...,716,1770653,NoYesNoYesNoNoNoYesNoNoYesNoYesNoNoNoNoNoNoYes...,3958,3106
1,Married,69,20662,5295,584446,MaleMaleFemaleMaleMaleFemaleMaleMaleMaleMaleFe...,1468,3770319,NoNoNoNoNoYesYesNoYesNoYesYesNoNoYesNoNoNoNoNo...,8431,6470
2,Single,103,13617,3374,387862,MaleMaleFemaleMaleMaleMaleFemaleMaleMaleMaleMa...,1065,2257073,NoNoNoNoNoNoYesNoNoNoNoNoNoYesYesNoNoNoYesYesN...,5852,3975

- **by=['feature1', 'feature2']** 과 같이 집계 기준 열을 여럿 설정할 수도 있습니다.

In [109]:
# 'MaritalStatus', 'Gender'별 나머지 열들 평균 조회
data_sum = data.groupby(['MaritalStatus', 'Gender'], as_index=False)[['Age','MonthlyIncome']].mean()

# 확인
data_sum

  MaritalStatus  Gender        Age  MonthlyIncome
0      Divorced  Female  37.010526    6626.315789
1      Divorced    Male  37.810651    6752.384615
2       Married  Female  38.774194    7301.493088
3       Married    Male  37.003021    6603.912387
4        Single  Female  35.261146    5963.445860
5        Single    Male  35.599119    5818.555066

### (3) 여러 함수로 한꺼번에 집계 .agg

* df.groupby(  )**.agg(['함수1','함수2', ...])**

In [112]:
data_agg = data.groupby('MaritalStatus', as_index=False)[['MonthlyIncome']].agg(['min','max','mean'])
# 확인
data_agg

              MonthlyIncome
                        min    max         mean
MaritalStatus
Divorced               1129  19973  6707.018939
Married                1052  19999  6880.144161
Single                 1009  19926  5877.794271

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] 데이터를 불러와 데이터프레임으로 저장합니다.

- 파일 경로 : https://raw.githubusercontent.com/DA4BAM/dataset/master/airquality.csv

**[airquality_simple 데이터 셋 정보]**

- Ozone : 오존농도
- Solar.R: 태양복사열
- Wind: 풍속
- Temp: 기온
- Month: 월
- Day: 일

In [88]:
# 데이터 읽어오기
data = pd.read_csv('./airquality_simple.csv')
# 상위 5개 확인
print(data.info())
data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Ozone    153 non-null    int64
 1   Solar.R  146 non-null    float64
 2   Wind     153 non-null    float64
 3   Temp     153 non-null    int64
 4   Month    153 non-null    int64
 5   Day      153 non-null    int64
dtypes: float64(2), int64(4)
memory usage: 7.3 KB
None

   Ozone  Solar.R  Wind  Temp  Month  Day
0     41    190.0   7.4    67      5    1
1     36    118.0   8.0    72      5    2
2     12    149.0  12.6    74      5    3
3     18    313.0  11.5    62      5    4
4     19      NaN  14.3    56      5    5

[문2] 월별 Ozone, Wind, Temp 평균을 구해 봅시다.

In [90]:
data.groupby('Month', as_index=False)[['Ozone','Wind','Temp']].mean()

   Month      Ozone       Wind       Temp
0      5  22.677419  11.622581  65.548387
1      6  40.133333  10.266667  79.100000
2      7  56.870968   8.941935  83.903226
3      8  59.000000   8.793548  83.967742
4      9  31.166667  10.180000  76.900000

[문3] 월별 Ozone, Wind, Temp에 대해 최대, 최소, 평균, 표준편차 값을 구해 봅시다.

### (4) 복습문제

[문1] pandas 라이브러리를 pd 별칭을 주어 불러오세요.

[문2] read_csv() 함수를 사용해 다음 경로의 파일을 불러와 **titanic** 데이터프레임을 만드세요.

- 파일 경로: 'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'

**[titanic_simple 데이터 셋 정보]**

- PassengerId : 승객번호
- Survived : 생존여부(1:생존, 0:사망)
- Pclass : 객실등급(1:1등급, 2:2등급, 3:3등급)
- Name : 승객이름
- Sex : 성별(male, female)
- Age : 나이
- Fare : 운임($)
- Embarked : 승선지역(Southhampton, Cherbourg, Queenstown)

In [53]:
# 파일 읽어오기

[문3] Fare의 중앙값을 확인해 봅시다.

In [91]:
titanic['Fare'].median()

14.4542

[문4] 승선지역(Embarked)별 평균 운임(Fare)을 구해 봅시다.

In [92]:
titanic.groupby('Embarked')['Fare'].mean()

Embarked
Cherbourg      59.954144
Queenstown     13.276030
Southampton    27.079812
Name: Fare, dtype: float64

[문5] 승선지역(Embarked)별, 성별(Sex)별 평균 운임(Fare)과 평균 나이(Age)를 tmp에 저장하고 조회하시오.

In [94]:
tmp = titanic.groupby(['Embarked','Sex'])[['Fare','Age']].mean()
tmp

                         Fare        Age
Embarked    Sex
Cherbourg   female  75.169805  28.344262
            male    48.262109  32.998841
Queenstown  female  12.634958  24.291667
            male    13.838922  30.937500
Southampton female  38.740929  27.771505
            male    21.711996  30.291440

[문6] 5번의 결과로 부터 파악할 수 있는 내용은 무엇인가요?

In [117]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

[문7] 객실등급(Pclass)별, 생존여부(Survived)별 나이(Age), 운임(Fare)의 최대, 최소, 평균, 표준편차를 tmp에 저장하고 조회하시오.

In [98]:
titanic.groupby(['Pclass','Survived'], as_index=False)[['Age','Fare']].agg(['max','min','mean','std'])

                  Age                                   Fare           \
                  max    min       mean        std       max      min
Pclass Survived
1      0         71.0   2.00  43.695312  15.284243  263.0000   0.0000
       1         80.0   0.92  35.368197  13.760017  512.3292  25.9292
2      0         70.0  16.00  33.544444  12.151581   73.5000   0.0000
       1         62.0   0.67  25.901566  14.837787   65.0000  10.5000
3      0         74.0   1.00  26.555556  12.334882   69.5500   0.0000
       1         63.0   0.42  20.646118  11.995047   56.4958   0.0000


                      mean        std
Pclass Survived
1      0         64.684007  60.662089
       1         95.608029  85.286820
2      0         19.412328  15.307175
       1         22.055700  10.853502
3      0         13.669364  12.118338
       1         13.694887  10.692993